EDA process on Swiggy Dataset

In [34]:
#---------------------------------------------  1. DATA COLLECTION----------------------------------------

First we need to import the required libraries.
Set the location of data set and read the CSV file.
Now,observe the behaviour of data using some methods like 
head()
tail()
info()
describe()
shape()
nunique() or
columns()

In [39]:
#-------------------------**********************Lets START EDA Process on SWIGGY Dataset****************************-----------------------------------------

Import Libraries

In [43]:
import pandas as pd       # data processing, CSV file I/O
import matplotlib as plt     # For visualizing the data 
import numpy as np       # Linear Algebra and creating arrays
import seaborn as sns  # Adv library for visualizing data
import os

In [44]:
os.chdir("C:\\Users\\batti\\Jupyter notebooks\\CSV.Jupyter notebook")   #chdir means change directory

In [45]:
data=pd.read_csv("swiggy.csv")            #for reading files
data

,ID,Area,City,Restaurant,Price,Avg ratings,Total ratings,Food type,Address,Delivery time
0,211,Koramangala,Bangalore,Tandoor Hut,300.0,4.4,100,"Biryani,Chinese,North Indian,South Indian",5Th Block,59
1,221,Koramangala,Bangalore,Tunday Kababi,300.0,4.1,100,"Mughlai,Lucknowi",5Th Block,56
2,246,Jogupalya,Bangalore,Kim Lee,650.0,4.4,100,Chinese,Double Road,50
3,248,Indiranagar,Bangalore,New Punjabi Hotel,250.0,3.9,500,"North Indian,Punjabi,Tandoor,Chinese",80 Feet Road,57
4,249,Indiranagar,Bangalore,Nh8,350.0,4.0,50,"Rajasthani,Gujarati,North Indian,Snacks,Desser...",80 Feet Road,63
...,...,...,...,...,...,...,...,...,...,...
8675,464626,Panjarapole Cross Road,Ahmedabad,Malt Pizza,500.0,2.9,80,Pizzas,Navrangpura,40
8676,465835,Rohini,Delhi,Jay Mata Ji Home Kitchen,200.0,2.9,80,South Indian,Rohini,28
8677,465872,Rohini,Delhi,Chinese Kitchen King,150.0,2.9,80,"Chinese,Snacks,Tandoor",Rohini,58
8678,465990,Rohini,Delhi,Shree Ram Paratha Wala,150.0,2.9,80,"North Indian,Indian,Snacks",Rohini,28
8679,466488,Navrangpura,Ahmedabad,Sassy Street,250.0,2.9,80,"Chaat,Snacks,Chinese",Navrangpura,44

In [46]:
data.head()   #it prints 1st 5 rows data

,ID,Area,City,Restaurant,Price,Avg ratings,Total ratings,Food type,Address,Delivery time
0,211,Koramangala,Bangalore,Tandoor Hut,300.0,4.4,100,"Biryani,Chinese,North Indian,South Indian",5Th Block,59
1,221,Koramangala,Bangalore,Tunday Kababi,300.0,4.1,100,"Mughlai,Lucknowi",5Th Block,56
2,246,Jogupalya,Bangalore,Kim Lee,650.0,4.4,100,Chinese,Double Road,50
3,248,Indiranagar,Bangalore,New Punjabi Hotel,250.0,3.9,500,"North Indian,Punjabi,Tandoor,Chinese",80 Feet Road,57
4,249,Indiranagar,Bangalore,Nh8,350.0,4.0,50,"Rajasthani,Gujarati,North Indian,Snacks,Desser...",80 Feet Road,63

In [47]:
data.tail()  #it prints last 5 values

,ID,Area,City,Restaurant,Price,Avg ratings,Total ratings,Food type,Address,Delivery time
8675,464626,Panjarapole Cross Road,Ahmedabad,Malt Pizza,500.0,2.9,80,Pizzas,Navrangpura,40
8676,465835,Rohini,Delhi,Jay Mata Ji Home Kitchen,200.0,2.9,80,South Indian,Rohini,28
8677,465872,Rohini,Delhi,Chinese Kitchen King,150.0,2.9,80,"Chinese,Snacks,Tandoor",Rohini,58
8678,465990,Rohini,Delhi,Shree Ram Paratha Wala,150.0,2.9,80,"North Indian,Indian,Snacks",Rohini,28
8679,466488,Navrangpura,Ahmedabad,Sassy Street,250.0,2.9,80,"Chaat,Snacks,Chinese",Navrangpura,44

In [48]:
data.columns # It prints all the column names in the dataset

Index(['ID', 'Area', 'City', 'Restaurant', 'Price', 'Avg ratings',
       'Total ratings', 'Food type', 'Address', 'Delivery time'],
      dtype='object')

In [49]:
data.info()     #for knowing all the no. of column names and their datatypes and it also tells whether the data is null (or) non-null

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8680 entries, 0 to 8679
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ID             8680 non-null   int64
 1   Area           8680 non-null   object
 2   City           8680 non-null   object
 3   Restaurant     8680 non-null   object
 4   Price          8680 non-null   float64
 5   Avg ratings    8680 non-null   float64
 6   Total ratings  8680 non-null   int64
 7   Food type      8680 non-null   object
 8   Address        8680 non-null   object
 9   Delivery time  8680 non-null   int64
dtypes: float64(2), int64(3), object(5)
memory usage: 678.3+ KB

In [50]:
data.describe()    #describe() fun is used to tell the count,mean,standard deviation,min,max of the data

                  ID        Price  Avg ratings  Total ratings  Delivery time
count    8680.000000  8680.000000  8680.000000    8680.000000    8680.000000
mean   244812.071429   348.444470     3.655104     156.634793      53.967051
std    158671.617188   230.940074     0.647629     391.448014      14.292335
min       211.000000     0.000000     2.000000      20.000000      20.000000
25%     72664.000000   200.000000     2.900000      50.000000      44.000000
50%    283442.000000   300.000000     3.900000      80.000000      53.000000
75%    393425.250000   400.000000     4.200000     100.000000      64.000000
max    466928.000000  2500.000000     5.000000   10000.000000     109.000000

In [51]:
data.nunique()    # It prints all the no of diff types of values in every column----- like in dataset city shows 9 so the city names are
#   ['Bangalore', 'Hyderabad', 'Mumbai', 'Pune', 'Kolkata', 'Delhi', 'Chennai', 'Ahmedabad', 'Surat'], dtype=object)

ID               8680
Area              833
City                9
Restaurant       7865
Price             120
Avg ratings        30
Total ratings       8
Food type        3734
Address          2339
Delivery time      81
dtype: int64

In [52]:
data['City'].unique()         # In specific column  how many kinds of data are there

array(['Bangalore', 'Hyderabad', 'Mumbai', 'Pune', 'Kolkata', 'Delhi',
       'Chennai', 'Ahmedabad', 'Surat'], dtype=object)

In [53]:
data.shape #It tells no of rows and columns

(8680, 10)

In [54]:
data['Price'].values      # It give the values of a specific column

array([300., 300., 650., ..., 150., 150., 250.])

In [55]:
data['Avg ratings'].values

array([4.4, 4.1, 4.4, ..., 2.9, 2.9, 2.9])

In [ ]:
#------------------------------------------------ 2.DATA PREPROCESSING----------------------------------------------------

In this step,Involves
1-- Data cleaning
2-- Data Reduction
3-- Data Transformation
4-- data discretization 
5-- data integration

So,for that we use some methods like
data.isnull().sum()   #check no of null values
data.dropna(axis=0,inplace=True)   # if it is there then use this method to remove those
[features for features in df .columns if df[features].isnull().sum()>1]     # it prints the null values
a=data.drop(['Address'],axis=1)           #If u don't want a specific column then remove those column using "drop"
rename() or replace()

In [ ]:
data.isnull()   # So,if any NULL value is there then it show "TRUE"otherwise it shows FALSE

In [ ]:
data.isnull().sum() #It checks wheather the null value is present or not and it returns count of the null value
# If there---by data.dropna(axis=0,inplace=True) method we can remove all null values
# here in the above dropna method we use axis=0 <--it refers that row(if any row contains null value then it removes those null values)
# if we want to remove column names so give  data.dropna(axis=1,inplace=True) ----give axis=1 or axis='columns'
#In that method inplace refers that inplace: If it is True, then it replaces in place.

In [ ]:
[features for features in data .columns if data[features].isnull().sum()>1] #it prints all over the null values presented in data set
                #             [OR]
[features for features in data .columns if data[features].isnull().sum()]

In [ ]:
data.dtypes    # It shows the datatype of each and every column

1.DATA CLEANING

In [ ]:
a=data.drop(['Address'],axis=1)           #If u don't want a specific column then remove those column using "drop". Here axis=1 represents column

In [ ]:
a

In [59]:
display(data[data['Avg ratings']==5.0])    # It checks the restaurant ratings 5 out of 5 and print those only

,ID,Area,City,Restaurant,Price,Avg ratings,Total ratings,Food type,Address,Delivery time
3894,357553,Bandra East,Mumbai,Diamond Market Pizza Jp,600.0,5.0,20,Italian,Scruz Bandra East,43
5424,427280,Chembur,Mumbai,Get In My Belly,500.0,5.0,20,Indian,Chembur,58
5425,427282,Chembur,Mumbai,The Asian Pavilion,200.0,5.0,20,Asian Chinese,Chembur,64
5519,431996,Scruz Bandra East,Mumbai,Cafe Kokomo,400.0,5.0,50,"Beverages,Snacks,Desserts,Bakery",Scruz Bandra East,46
5684,438198,Kothrud,Pune,Papacream,350.0,5.0,20,Ice Cream,Kothrud,52
5798,441870,Himayath Nagar,Hyderabad,Wallonia Waffle Co.,300.0,5.0,20,Desserts,Himayath Nagar,45
5799,442021,Himayath Nagar,Hyderabad,Splurge - Thickshakes And Milkshakes,300.0,5.0,20,Desserts Ice Cream Beverages,Himayath Nagar,45
5800,442023,Himayath Nagar,Hyderabad,The Liege Waffles,300.0,5.0,20,Desserts Bakery,Himayath Nagar,45
5885,444623,Andheri East,Mumbai,Nivala Apka Apna,200.0,5.0,20,"North Indian,Chinese,Indian",Andheri East,48
5936,446397,Koramangala,Bangalore,Tricky Shakes,250.0,5.0,20,"Ice Cream,Beverages",Koramangala,62
6033,448909,Himayath Nagar,Hyderabad,Zorro - Milkshakes And Thickshakes,300.0,5.0,20,Beverages,Himayath Nagar,46
6297,458258,Nsp,Delhi,Fat Tiger,300.0,5.0,20,"Pizzas,Chinese,Snacks,Beverages,American",Nsp,73
6390,465218,Annanagar,Chennai,Nasi And Mee,1200.0,5.0,20,"Pan-Asian,Singaporean,Malaysian,Japanese,Asian...",Annanagar,70
6538,13188,Shivajinagar,Pune,Shree Krishna Juice Bar,150.0,5.0,20,"Juices,Beverages",Near Ghole Road,39
6930,50343,Bkc,Mumbai,Snaxx,500.0,5.0,20,Snacks,Bkc,44
8011,321807,Basavanagudi,Bangalore,Creams & Bites,200.0,5.0,20,Ice Cream,Basavanagudi,50
8439,432094,Esplanade,Kolkata,Keventers Ice Creamery,300.0,5.0,20,"Ice Cream,Desserts",New Empire Cinema Kolkata,45
8571,450543,Perambur,Chennai,Afresh,100.0,5.0,20,"Healthy Food,Salads,Desserts,Beverages",Perambur,50

DATA RENAMING (columns)

In [ ]:
# why i renamed this becoz in the nxt step i want to take specific one in Food type but it can't accept gap like "Food type" it takes only single word like 'Food"
data=data.rename(columns={'Food type':'Food'})               
# we can also use rename(),replace() method to convert the column name from one name to another
data         # Print

In [ ]:
data=data.replace('Food type','Food',regex=True)
data.head()
data.dtypes

2. DATA REDUCTION

In [ ]:

Food=data.query("Food=='Pizzas' and City=='Delhi'") # i want to print pizza in food and also want to print delhi in city
Food

In [ ]:
#------------------------------------------------ 3.DATA VISUALIZATION----------------------------------------------------

In [ ]:
import matplotlib.pyplot as plt
from matplotlib import style
from matplotlib import figure
style.use('fivethirtyeight')

In [ ]:
plt.bar(Food['Restaurant'],Food['Delivery time'])
plt.title('Delivery time of pizzas by various restaurants')
plt.xlabel('DELHI')
plt.ylabel('Delivery Time')
plt.gcf().set_size_inches(7,5)
plt.xticks(rotation=90)
plt.show()

In [ ]:

#plt.bar(Food[''],Food['Delivery time'])
#plt.title('Delivery time of pizzas by various restaurants')
#plt.xlabel('DELHI')
#plt.ylabel('Delivery Time')
#plt.gcf().set_size_inches(7,5)
#plt.xticks(rotation=90)
#plt.show()

In [ ]:
#---------------------------------------------------------------------------------------------------------------------

Now, We can create more visuals by using the dataset.

In [ ]:
data

Use Seaborn Library

 Here the visual shows there is no null value was there on dataset if a null value is there then it shows yellow or any colour point to indicate that.

In [ ]:
sns.heatmap(data.isnull(),yticklabels=False,cbar=False,cmap='viridis')
#here cmap=viridis shows the null valkues in yellow colour but here we don't have.

In [ ]:
import matplotlib.pyplot as plt
from matplotlib import style
from matplotlib import figure
style.use('fivethirtyeight')

In [ ]:
plt.barh(data['City'],data['Total ratings'],color='r')
plt.title('Ratings on Restaurants')
plt.ylabel('Total Cities')
plt.xlabel('Total Ratings')
plt.gcf().set_size_inches(5, 3)
plt.xticks(rotation=90)
plt.show()

In [ ]:
Jogupalya=data[data.Area=='Jogupalya']

In [ ]:
Jogupalya['Area']

In [ ]:
Jogupalya

In [ ]:
plt.bar(Jogupalya['Food'],Jogupalya['Avg ratings'],color='#380281')
#plt.bar(Jogupalya['Food'],Jogupalya['Avg ratings'],Jogupalya['Total ratings'],color='red')
plt.title('Average Ratings on Food')
plt.legend()
plt.xlabel('Food types in Jogupalya Area')
plt.ylabel('Avg ratings')
plt.gcf().set_size_inches(10,5)
plt.xticks(rotation=70)
plt.show()

In [ ]:
sns.displot(data['Delivery time'])
plt.xticks(rotation=90)

In [ ]:
#City=data["City"].value_counts().head(10).values
#name=data["City"].value_counts().head(10).index
#plt.gcf().set_size_inches(20, 11)
#plt.pie(City,labels=City,autopct="%1.1f%%",wedgeprops={'edgecolor':'black'},explode=[0.1,0,0,0,0,0,0,0,0,0])
#plt.title('Top 10')
#plt.show()

In [ ]:
data.boxplot()
plt.xticks(rotation=70)